ECN_Spray_A/constant/mixtureFractionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mixtureFractionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

oxidizerMassFractions
{
    O2       0.164119;
    N2       0.7198319;
    CO2      0.0937502;
    H2O      0.0222989;
}

fuelMassFractions
{
    C12H26       1.0;
}

#include "$FOAM_CASE/constant/specieElements_Yao.foam"
// ************************************************************************* //

