ECN_Spray_A/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       ( C12H26 C12H25O2 Z H2O2 OH T CH2O );

surfaces
(

   zNormal
   {
       type            cuttingPlane;
       planeType       pointAndNormal;
       pointAndNormalDict
       {
           basePoint       (0.05 0 0);
           normalVector    (0 0 1);
       }
       interpolate     true; //false; //true;
   }

   yNormal
   {
       type            cuttingPlane;
       planeType       pointAndNormal;
       pointAndNormalDict
       {
           basePoint       (0.05 0 0);
           normalVector    (0 1 0);
       }
       interpolate     true; //false; //true;
   }

);

// ************************************************************************* //
