ECN_Spray_A/system/turbulenceIntensity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates and writes the turbulence intensity field I.

\*---------------------------------------------------------------------------*/

type            turbulenceIntensity;
libs            ("libfieldFunctionObjects.so");

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
